# математические операции

#  Средняя продолжительность жизни в России (лет)

ale = 71
age = int(input('Cколько Вам лет?:'))

# Операция деления "/"
live_part = age/ale
print('Часть прожитой жизни', live_part)

#  Операция целая часть от деления "//"
live_part = age//ale
print('Часть прожитой жизни', live_part)

# % остаток от деления
print(end=' остаток от деления 3%2 = ')
print(3%2)
print(end=' остаток от деления 4%2 = ')
print(4%2)
print(end=' остаток от деления 5%3 = ')
print(5%3)

# ** возведение в степень
print(end=' возведение в степень 2**10 = ')
print(2**10)
print(end=' возведение в степень 2**2 = ')
print(2**2)